sslivins/arctic-controller/sdkconfig.defaults
# Arctic Heat Pump Controller - ESP32-P4 Tab5 Configuration

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# Disable XIP from PSRAM - run code from flash cache instead
# This resolves the PSRAM memory mapping overflow issue caused by large code size
CONFIG_SPIRAM_XIP_FROM_PSRAM=n

# ESP-Hosted WiFi Configuration (ESP32-C6 co-processor via SDIO)
# Using esp_hosted 1.4.0 to match M5Stack Tab5's pre-flashed C6 firmware
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
# Tab5 SDIO GPIOs for ESP32-C6 (from M5Stack docs and their demo sdkconfig)
# CLK=12, CMD=13, D0=11, D1=10, D2=9, D3=8, RST=15
# Note: esp_hosted 1.4.0 uses different symbol names than 2.11.x
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
# Note: Tab5 ESP32-C6 comes pre-flashed with WiFi SDIO firmware v1.4.1

# WiFi performance - keep IRAM optimizations enabled (device is always-on, plugged in)
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y
# Sleep optimization not needed - device never sleeps
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n

# Disable WiFi power save for consistent low-latency API responses
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# WPA Supplicant memory optimizations
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_SAE_PK=n
CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n

# Reduce WiFi buffers to save memory
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# mbedTLS optimizations - reduce crypto footprint
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048

# Move FreeRTOS functions from IRAM to flash
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# Move SPI flash driver functions from IRAM to flash (saves ~2KB IRAM)
CONFIG_SPI_FLASH_ROM_IMPL=y

# Reduce HAL IRAM usage
CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=0

# Disable mbedTLS hardware acceleration IRAM placement
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_HARDWARE_SHA=n

# Newlib nano formatting - reduces code size
CONFIG_NEWLIB_NANO_FORMAT=y

CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Increase system event task stack for fmt library in callbacks
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# LVGL Configuration
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_PERF_MONITOR=y
# Enable IRAM for LVGL fast memory - device is always-on, optimize for smooth UI
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# Fonts - Reduced set to save code space
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
